In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
mydataset = {
    'cars': ["BMW", "Volvo", "Ford"],
    'passing': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)
print(myvar)

    cars  passing
0    BMW        3
1  Volvo        7
2   Ford        2

In [4]:
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [5]:
print(myvar[2])

2

In [6]:
myvar = pd.Series(a, index = ["X", "Y", "Z"])
print(myvar)

X    1
Y    7
Z    2
dtype: int64

In [7]:
print(myvar["Y"])

7

In [8]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [9]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories, index = ["day1", "day2"])
print(myvar)

day1    420
day2    380
dtype: int64

# DataFrame

In [10]:
import pandas as pd

In [11]:
data = {
    "calories": [420, 380, 390],
    "duration": [50, 40, 45]
}
myvar = pd.DataFrame(data)
print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

In [12]:
data = {
    "calories": [420, 380, 390],
    "duration": [50, 40, 45]
}
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [13]:
df.loc[0]     ###refer to the row index: it returns a Pandas Series

calories    420
duration     50
Name: 0, dtype: int64

In [14]:
print(df.loc[[0,1]])

   calories  duration
0       420        50
1       380        40

In [15]:
data = {
    "calories": [420, 380, 390],
    "duration": [50, 40, 45]
}
df = pd.DataFrame(data, index = ["day1", "day2","day3"])
df

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [16]:
df.loc["day2"]

calories    380
duration     40
Name: day2, dtype: int64

In [17]:
df = (r"C:\Users\siddh\Downloads\numpy.xlsx")

In [18]:
import pandas as pd
data = {
    'Name of Students' : ['Siddhi', 'Heli', 'Disha', 'Ritik', 'Deepak'],
    'Course Name' : ['DS', 'DA', 'Python', 'DS', 'DA'],
    'Total Marks' : [77, 80, 93, 79, 83]
}
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E'])
df

  Name of Students Course Name  Total Marks
A           Siddhi          DS           77
B             Heli          DA           80
C            Disha      Python           93
D            Ritik          DS           79
E           Deepak          DA           83

In [19]:
df['Name of Students']                         ### display singal column

A    Siddhi
B      Heli
C     Disha
D     Ritik
E    Deepak
Name: Name of Students, dtype: object

In [20]:
df[['Course Name', 'Total Marks']]      ###display more than one columns

  Course Name  Total Marks
A          DS           77
B          DA           80
C      Python           93
D          DS           79
E          DA           83

In [21]:
import pandas as pd
data = {
    'Name of Students' : ['Siddhi', 'Heli', 'Disha', 'Ritik', 'Deepak'],
    'Course Name' : ['DS', 'DA', 'Python', 'DS', 'DA'],
    'Total Marks' : [77, 80, 93, 79, 83]
}
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D', 'E'])

address = ['Surat', 'Delhi', 'Pune', 'Vadodara', 'Mumbai']
df['Address'] = address

df

  Name of Students Course Name  Total Marks   Address
A           Siddhi          DS           77     Surat
B             Heli          DA           80     Delhi
C            Disha      Python           93      Pune
D            Ritik          DS           79  Vadodara
E           Deepak          DA           83    Mumbai

In [22]:
DOB = ['17/11', '15/01', '30/10', '5/9', '6/12'] 
df['Date of Birth'] = DOB
df

  Name of Students Course Name  Total Marks   Address Date of Birth
A           Siddhi          DS           77     Surat         17/11
B             Heli          DA           80     Delhi         15/01
C            Disha      Python           93      Pune         30/10
D            Ritik          DS           79  Vadodara           5/9
E           Deepak          DA           83    Mumbai          6/12

In [23]:
py = [2016, 2018, 2017, 2019, 2020]
df['Passing Year'] = py
df

,Name of Students,Course Name,Total Marks,Address,Date of Birth,Passing Year
A,Siddhi,DS,77,Surat,17/11,2016
B,Heli,DA,80,Delhi,15/01,2018
C,Disha,Python,93,Pune,30/10,2017
D,Ritik,DS,79,Vadodara,5/9,2019
E,Deepak,DA,83,Mumbai,6/12,2020

In [24]:
df = df.drop(['Address'], axis = 1)


df
###df = df.drop(['DOJ'], axis = 1)

  Name of Students Course Name  Total Marks Date of Birth  Passing Year
A           Siddhi          DS           77         17/11          2016
B             Heli          DA           80         15/01          2018
C            Disha      Python           93         30/10          2017
D            Ritik          DS           79           5/9          2019
E           Deepak          DA           83          6/12          2020

In [25]:
#df.drop(['Passing Year'], axis=1, inplace = True)
#df

In [26]:

df.loc['F'] = ['Kruti', 'DS', 44, '7/9', 2011]
df

  Name of Students Course Name  Total Marks Date of Birth  Passing Year
A           Siddhi          DS           77         17/11          2016
B             Heli          DA           80         15/01          2018
C            Disha      Python           93         30/10          2017
D            Ritik          DS           79           5/9          2019
E           Deepak          DA           83          6/12          2020
F            Kruti          DS           44           7/9          2011

In [27]:
df.loc['G'] = ['Priya', 'DS', 73, np.nan, 2022]
df

  Name of Students Course Name  Total Marks Date of Birth  Passing Year
A           Siddhi          DS           77         17/11          2016
B             Heli          DA           80         15/01          2018
C            Disha      Python           93         30/10          2017
D            Ritik          DS           79           5/9          2019
E           Deepak          DA           83          6/12          2020
F            Kruti          DS           44           7/9          2011
G            Priya          DS           73           NaN          2022

In [28]:
df[['Total Marks', 'Course Name', 'Name of Students']].loc['D' : 'G']

   Total Marks Course Name Name of Students
D           79          DS            Ritik
E           83          DA           Deepak
F           44          DS            Kruti
G           73          DS            Priya

In [29]:
df[['Passing Year']].loc[['A', 'G']]  ##select only b and e

   Passing Year
A          2016
G          2022

In [30]:
df['Total Marks']>80

A    False
B    False
C     True
D    False
E     True
F    False
G    False
Name: Total Marks, dtype: bool

In [31]:
df[df['Total Marks']>80]

  Name of Students Course Name  Total Marks Date of Birth  Passing Year
C            Disha      Python           93         30/10          2017
E           Deepak          DA           83          6/12          2020

In [46]:
A = pd.Series([2, 4, 6], index =[0, 1, 2])
B = pd.Series([1, 3, 5], index =[1, 2, 3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [36]:
A = pd.Series([2, 4, 6], index =[1, 2, 3])
B = pd.Series([1, 3, 5], index =[1, 2, 3])
A+B

1     3
2     7
3    11
dtype: int64

In [33]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [41]:
A = pd.Series([2, 4, 6], index =[0, 1, 2])
B = pd.Series([1, 3, 5], index =[1, 2, 3])

A-B

0    NaN
1    3.0
2    3.0
3    NaN
dtype: float64

In [42]:
A = pd.Series([2, 4, 6], index =[1, 2, 3])
B = pd.Series([1, 3, 5], index =[1, 2, 3])
A-B

1    1
2    1
3    1
dtype: int64

In [44]:
A = pd.Series([2, 4, 6], index =[0, 1, 2])
B = pd.Series([1, 3, 5], index =[1, 2, 3])

A.sub(B, fill_value=0)

0    2.0
1    3.0
2    3.0
3   -5.0
dtype: float64

In [47]:
A = pd.Series([2, 4, 6], index =[0, 1, 2])
B = pd.Series([1, 3, 5], index =[1, 2, 3])
A*B

0     NaN
1     4.0
2    18.0
3     NaN
dtype: float64

In [48]:
A = pd.Series([2, 4, 6], index =[1, 2, 3])
B = pd.Series([1, 3, 5], index =[1, 2, 3])
A*B

1     2
2    12
3    30
dtype: int64

In [49]:
A = pd.Series([2, 4, 6], index =[0, 1, 2])
B = pd.Series([1, 3, 5], index =[1, 2, 3])

A.mul(B, fill_value=0)

0     0.0
1     4.0
2    18.0
3     0.0
dtype: float64

In [50]:
A = pd.Series([2, 4, 6], index =[0, 1, 2])
B = pd.Series([1, 3, 5], index =[1, 2, 3])

A/B

0    NaN
1    4.0
2    2.0
3    NaN
dtype: float64

In [51]:
A = pd.Series([2, 4, 6], index =[1, 2, 3])
B = pd.Series([1, 3, 5], index =[1, 2, 3])
A/B

1    2.000000
2    1.333333
3    1.200000
dtype: float64

In [52]:
A = pd.Series([2, 4, 6], index =[0, 1, 2])
B = pd.Series([1, 3, 5], index =[1, 2, 3])

A.div(B, fill_value=0)

0    inf
1    4.0
2    2.0
3    0.0
dtype: float64

In [57]:
df = pd.DataFrame({'angles' : [0, 3, 4],
                  'degrees' : [360, 180, 360]},
                 index = ['circle', 'triangle', 'rectangle'])
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [58]:
df + 1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [59]:
df.add(4)

           angles  degrees
circle          4      364
triangle        7      184
rectangle       8      364

In [60]:
df - 2

           angles  degrees
circle         -2      358
triangle        1      178
rectangle       2      358

In [61]:
df.sub(3)

           angles  degrees
circle         -3      357
triangle        0      177
rectangle       1      357

In [62]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [63]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [ ]:
s1 = pd.Series(np.arange(4),
              index=['a', 'c', 'd', 'e'])
s2 = pd.Series(np.arange(5),
              index=['a', 'c', 'e', ])